<a href="https://colab.research.google.com/github/priyanka16march/assigenment/blob/master/DAy1_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
emp = pd.read_csv("/content/employees (1).csv")
emp

    First Name  Gender  ... Senior Management                  Team
0      Douglas    Male  ...              True             Marketing
1       Thomas    Male  ...              True                   NaN
2        Maria  Female  ...             False               Finance
3        Jerry    Male  ...              True               Finance
4        Larry    Male  ...              True       Client Services
..         ...     ...  ...               ...                   ...
995      Henry     NaN  ...             False          Distribution
996    Phillip    Male  ...             False               Finance
997    Russell    Male  ...             False               Product
998      Larry    Male  ...             False  Business Development
999     Albert    Male  ...              True                 Sales

[1000 rows x 8 columns]

In [4]:
type(emp)

pandas.core.frame.DataFrame

In [7]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [8]:
emp.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male   8/6/1993  ...   6.945               True        Marketing
1     Thomas    Male  3/31/1996  ...   4.170               True              NaN
2      Maria  Female  4/23/1993  ...  11.858              False          Finance
3      Jerry    Male   3/4/2005  ...   9.340               True          Finance
4      Larry    Male  1/24/1998  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [9]:
emp.tail()

    First Name Gender  ... Senior Management                  Team
995      Henry    NaN  ...             False          Distribution
996    Phillip   Male  ...             False               Finance
997    Russell   Male  ...             False               Product
998      Larry   Male  ...             False  Business Development
999     Albert   Male  ...              True                 Sales

[5 rows x 8 columns]

In [11]:
emp.sample(5)   # random data

    First Name  Gender  Start Date  ... Bonus %  Senior Management             Team
272       Fred    Male   2/20/1980  ...  18.225              False          Product
474   Jonathan    Male   8/15/2002  ...  11.364              False      Engineering
40     Michael    Male  10/10/2008  ...   2.665               True     Distribution
82      Steven    Male   3/30/1980  ...   8.379               True  Client Services
124    Marilyn  Female  11/16/1983  ...   2.401               True          Product

[5 rows x 8 columns]